{
  "0-1 months (0 months)": [
    "Newborns love skin-to-skin contact. Try holding your baby close to your chest.",
    "Gently talk or hum to your baby — your voice soothes them.",
    "Keep your baby swaddled and warm. They love feeling secure."
  ],
  "2-3 months (2-3 months)": [
    "Your baby may start smiling! Try smiling and talking to them to build connection.",
    "Use soft rattles or black-and-white cards to engage their eyes.",
    "Sing short, simple songs — babies this age enjoy repetition."
  ],
  "4-5 months (4-5 months)": [
    "Tummy time helps build neck strength. A few minutes a day is great!",
    "Place toys just out of reach during tummy time to encourage movement.",
    "Let your baby watch you make funny faces — it helps their social learning."
  ],
  "6-7 months (6-7 months)": [
    "Babies may start sitting up. Encourage them with safe toys around them.",
    "Use a mirror to play — babies love looking at faces, even their own.",
    "Encourage reaching and grasping by offering toys at different angles."
  ],
  "8-9 months (8-9 months)": [
    "Your baby might start crawling soon. Baby-proof your space!",
    "Play peekaboo — it's great for developing object permanence.",
    "Use soft blocks or stacking cups to build motor skills."
  ],
  "10-11 months (10-11 months)": [
    "Encourage babbling by talking and singing. Responding builds language skills.",
    "Play clapping games to build rhythm and coordination.",
    "Offer a safe spoon for self-feeding practice."
  ],
  "12-13 months (1.0–1.1 years)": [
    "Your toddler may start walking! Let them explore safely and cheer them on.",
    "Provide push toys to support early walking.",
    "Name objects as your child points to them — it supports language learning."
  ],
  "14-15 months (1.2–1.3 years)": [
    "At this age, your child loves repetition. Read the same books again and again!",
    "Sing the same songs every day — repetition builds memory.",
    "Offer simple puzzles with big pieces to challenge their curiosity."
  ],
  "16-18 months (1.4–1.6 years)": [
    "Naming objects helps word learning. Try pointing and saying what you see together.",
    "Let your child help with simple tasks like putting toys in a box.",
    "Encourage pretend play — a spoon can be a magic wand!"
  ],
  "19-21 months (1.7–1.9 years)": [
    "Your child may start showing emotions. Help them name feelings like happy or sad.",
    "Talk about what you’re doing — this helps your child learn new words.",
    "Validate their emotions with calm words like 'I see you're upset.'"
  ],
  "22-24 months (1.10–2.0 years)": [
    "Play pretend with toys — it supports imagination and social skills development.",
    "Use simple two-word phrases often like 'big truck' or 'cold milk'.",
    "Offer crayons and paper — scribbling is early writing!"
  ],
  "25-36 months (2.1–3.0 years)": [
    "Your toddler may now start expressing independence — offer choices like 'this or that'.",
    "Create small routines together — they love predictability.",
    "Use short phrases to help them name their feelings and needs."
  ],
  "37-48 months (3.1–4.0 years)": [
    "Preschoolers love to help! Let them assist with simple chores to build confidence.",
    "Play make-believe together — it builds creativity and connection.",
    "Help them tell simple stories with drawings or toys."
  ],
  "49-60 months (4.1–5.0 years)": [
    "Your child is asking 'why?' a lot — be patient, it’s how they learn about the world.",
    "Encourage questions — even if you don’t have all the answers.",
    "Invite them to help you cook or fold clothes — it's great bonding and learning time."
  ],
  "61-72 months (5.1–6.0 years)": [
    "Kindergarten-age kids thrive on routines and responsibilities. Build small rituals together.",
    "Ask them to share a 'rose and thorn' of their day — a highlight and a hard part.",
    "Encourage quiet solo play — it's important for developing independence."
  ]
}